#+TITLE: Make figures for article
#+Author: Anders Munch
#+Date: \today

#+LANGUAGE:  en
#+OPTIONS:   num:t toc:nil ':t ^:t
#+PROPERTY: header-args:R :async :results output verbatim  :exports results  :session *R* :cache no

* Numerical experiments
Marginal event and censoring probabilities:
#+BEGIN_SRC R :results output drawer
  event_cens_prob_table <- zel_sim2_1_n_events[,lapply(.SD, function(x) 100*x/100000) , .(time, sim_setting)]
  Publish::org(event_cens_prob_table[time == 36])
#+END_SRC

#+RESULTS:
:results:
| time | sim_setting | true_events | true_cens | at_risk |
|------+-------------+-------------+-----------+---------|
|   36 | original    |      24.619 |    61.853 |  25.774 |
|   36 | indep_cens  |      24.674 |    38.740 |  46.141 |
:end:


